<template>
	<div></div>
</template>
<!--  
  
  조건부 렌더링

  ----------------------------------------------------------------------------------------------------------------------------

    v-if

      v-if 디렉티브는 조건부로 블록을 렌더링하는 데 사용된다. 블록은 디렉티브 표현식이 thuthy 값을 반환하는 경우에만 렌더링된다.

        <h1 v-if="awesome">Vue는 정말 멋지죠!</h1>

  ----------------------------------------------------------------------------------------------------------------------------
  
    v-else

      v-else 디렉티브를 사용하여 v-if에 대한 "else 블록"을 나타낼 수 있다.

        <button @click="awesome = !awesome">전환</button>

        <h1 v-if="awesome">Vue는 정말 멋지죠!</h1>
        <h1 v-else>아닌가요? 😢</h1>

      v-else 엘리먼트는 v-if 또는 v-else-if 엘리먼트 바로 다음에 와야 한다. 그렇지 않으면 인식되지 않는다.

  ----------------------------------------------------------------------------------------------------------------------------

    v-else-if

      v-else-if는 이름에서 알 수 있듯이 v-if에 대한 "else-if 블록" 역할을 한다. 여러 번 연결될 수도 있다.

        <div v-if="type === 'A'">
          A
        </div>
        <div v-else-if="type === 'B'">
          B
        </div>
        <div v-else-if="type === 'C'">
          C
        </div>
        <div v-else>
          A/B/C 아님
        </div>

      v-else 와 마찬가지로 v-else-if 엘리먼트는 v-if 또는 v-else-if 엘리먼트 바로 다음에 와야 한다.

  ----------------------------------------------------------------------------------------------------------------------------

    <template> 에서 v-if

      v-if는 디렉티브이므로 단일 엘리먼트에 연결해야 한다. 하지만 둘 이상의 엘리먼트를 전환하려면 어떻게 해야 할까?
      이 경우 보이지 않는 래퍼 역할을 하는 <template> 엘리먼트에 v-if를 사용할 수 있다. 최종 렌더링된 결과에는 <template> 엘리먼트가 포함되지 않는다.

        <template v-if="ok">
          <h1>제목</h1>
          <p>단락 1</p>
          <p>단락 2</p>
        </template>

      v-else 및 v-else-if는 <template>에서도 사용할 수 있다.

  ----------------------------------------------------------------------------------------------------------------------------

    v-show

      엘리먼트를 조건부로 표시하는 다른 옵션은 v-show 디렉티브이다. 사용법은 대체로 동일하다.

        <h1 v-show="ok">안녕!</h1>

      차이점은 v-show가 있는 엘리먼트는 항상 렌더링되고 DOM에 남아 있다는 것이다.
      v-show는 엘리먼트의 display CSS 속성만 전환한다.

      v-show는 <template> 엘리먼트를 지원하지 않으며 v-else와 상호작용하지 않는다.

  ----------------------------------------------------------------------------------------------------------------------------

    v-if vs v-show

      v-if는 "실제" 조건부 렌더링이다. 왜냐하면 조건부 블록이 전환될 경우, 블록 내 이벤트 리스너와 자식 컴포넌트가 제대로 제거되거나 재생성되기 때문이다.
      또한 v-if는 게으르므로(lazy), 초기 조건이 false이면 아무 작업도 수행하지 앟는다. 조건부 블록은 조건이 true가 될 때까지 렌더링되지 않는다.

      이에 비해 v-show는 훨씬 간단하다. 엘리먼트는 CSS 기반으로 전환 되므로, 초기 조건과 관계없이 항상 렌더링 된다.

      일반적으로 v-if는 전환 비용이 더 높고, v-show는 초기 렌더링 비용이 더 높다. 따라서 매우 자주 전환해야 하는 경우
      v-show를, 실행 중에 조건이 변경되지 않는 경우 v-if를 사용하는 것이 좋다.

  ----------------------------------------------------------------------------------------------------------------------------

    v-if with v-show

      v-if와 v-show를 함께 사용하는 것은 권장되지 않는다.
      이것들이 같은 노드에 존재할 때 v-if가 v-for보다 우선순위가 높기 때문에 v-if 조건문에서 v-for 변수에 접근이할 수 없다.

        "todo" 속성이 인스턴스에 정의되어 있지 않기 때문에 에러가 발생한다.
        <li v-for="todo in todos" v-if="!todo.isComplete">
          {{ todo.name }}
        </li>

      <template> 태그로 감싼 후, v-for를 옮겨서 해결할 수 있다.(더 명시적이다.)

        <template v-for="todo in todos">
          <li v-if="!todo.isComplete">
            {{ todo.name }}
          </li>
        </template>

-->
<script>
export default {
	setup() {
		return {};
	},
};
</script>

<style lang="scss" scoped></style>
