<template>
	<div></div>
</template>
<!--  

  app.config

    app.config는 Vue 애플리케이션의 전역 설정을 담고 있는 객체이다. 
    이 객체를 사용하여 Vue 애플리케이션의 동작을 구성하고 조정할 수 있다.
    주요 구성 옵션들은 다음과 같다.

      1. app.config.productionTip
        개발 모드에서 Vue의 productionTip 메시지를 출력할지 여부를 결정한다. 기본값은 true이며 개발 중에는 true로 설정되어 있어서
        브라우저 콘솔에 Vue가 개발모드임을 알려주는 메시지가 출력된다. 프로덕션 모드에서는 보통 이 값을 false로 설정하여 이러한 메시지가 출력되지 않도록 한다.

      2. app.config.errorHandler
        애플리케이션에서 발생한 에러를 처리하는 함수를 설정한다. 이 함수는 전역적으로 애플리케이션에서 발생한 모든 에러를 캐치하고 처리할 수 있다.

      3. app.config.warnHandler
        Vue 경고 메시지를 처리하는 함수를 설정한다. 경고 메시지는 주로 개발 중에 잘못 사용된 Vue의 기능에 대한 경고로 사용된다.

      이 외에도 몇 가지 다른 구성 옵션이 있을 수 있으며, Vue의 향후 버전에서 변경될 수 있다.

      이러한 전역 설정은 Vue 애플리케이션의 동작을 조정하고 개발 및 디버깅 프로세스를 관리하는 데 도움이 된다.
      하지만 일반적으로 대부분의 애플리케이션에서는 이러한 설정을 변경할 필요가 없으며,
      기본값을 그대로 사용하는 것이 일반적이다. 필요한 경우에만 구성 옵션을 변경하여 특정한 동작을 조정할 수 있다.

  -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

  모든 앱 인스턴스는 해당 앱의 환경 설정이 포함된 config 객체를 노출한다.
  앱을 마운트하기 전에 속성을 수정할 수 있다.

    import { createApp } from 'vue'

    const app = createApp(/* ... */)

    console.log(app.config)

  -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

  app.config.errorHandler

    app.config.errorHandler는 Vue 애플리케이션에서 발생한 에러를 전역으로 처리하는 함수를 설정하는 속성이다.
    이 속성을 사용하면 애플리케이션 전체에서 발생한 예외를 캐치하고 처히라 수 있다.

    app.config.errorHandler는 일반적으로 개발 중에 발생하는 예외를 캐치하고 처리하는 데 사용된다.
    이를 통해 전역적으로 에러를 관리하고 사용자에게 피드백을 제공할 수 있다.
    예를 들어, 예외가 발생했을 때 콘솔에 로그를 출력하거나, 사용자에게 에러 메시지를 보여주는 등의 작업을 수행할 수 있다.

    이 함수는 다음과 같은 형식을 따른다.

      app.config.errorHandler = function (err, vm, info){
        // err : 발생한 에러 객체
        // vm  : Vue 인스턴스
        // info: Vue가 생성한 에러 정보(에러가 발생한 라이프사이클 훅과 관련 정보)

        //에러 처리 로직을 여기에 작성
      }

      이 함수는 세 개의 변수를 가지고 있다.

      1. err : 발생한 에러 객체이다. 이 객체에는 에러의 메시지, 스택 트레이스 등의 정보가 포함되어 있다.
      2. vm : 에러가 발생한 Vue 인스턴스이다. 이 인스턴스를 사용하여 애플리케이션의 상태를 확인하거나 조작할 수 있다.
      3. info : Vue가 생성한 에러 정보이다. 이 객체에는 에러가 발생한 라이프사이클 훅과 관련된 정보가 포함되어 있다.

      이 함수를 사용하여 발생한 예외를 적절히 처리하고 사용자에게 피드백을 제공할 수 있다.
      예를 들어, 발생한 예외를 콘솔에 로그로 출력하거나, 사용자에게 모달 창을 통해 에러 메시지를 보여주는 등의 작업을 수행할 수 있다.

    앱 내에서 예외 처리 되지 않은 에러 발생 시, 트리거 될 전역 핸들러를 정의힌다.

      * 스택 트레이스(stack trace)
        프로그램이 실행되는 동안 발생한 함수 호출의 순서를 역추적하거나 나타내는 정보.
        보통 예외가 발생했을 때 해당 예외가 발생한 원인을 찾는 데 사용된다.

        스택 트레이스는 함수 호출이 일어난 순서를 역순으로 기록한다. 가장 최근에 호출된 함수가 가장 위에 나타나고,
        호출 순서대로 아래로 내려간다. 스택 트레이스에는 각각의 함수 호출에 대한 정보가 포함되어 있으며, 일반적으로 함수의 이름, 파일명, 줄 번호 등이 표시된다.

        스택 트레이스는 주로 프로그램에서 발생한 오류를 디버깅할 때 사용된다. 예외가 발생했을 때 해당 예외가 발생한 위치를 파악하고,
        그 원인을 찾는 데 도움이 된다. 스택 트레이스를 통해 어떤 함수가 어디서 호출되었는지 추적할 수 있으며, 이를 통해 오류의 원인을 파악하고 수정할 수 있다.

        스택 트레이스는 주로 프로그래밍 언어나 개발 환경에 따라 다르게 표시될 수 있으며, 보통 에러 메시지나 디버깅 도구에서 제공된다.
        개발자 코드를 디버깅할 때 스택 트레이스를 자주 확인하여 문제의 원인을 파악하고 해결하는 데 활용한다.

    타입

      interface AppConfig {
        errorHandler?: (
          err: unknown,
          instance: ComponentPublicInstance | null,
          // `info`는 Vue 고유의 에러 정보.
          // 예: 에러 발생 생명 주기 훅 표시: 'created hook'
          info: string
        ) => void
      }

    세부 사항

      핸들러는 "에러", "에러를 트리거한 컴포넌트 인스턴스", "에러 출처 유형을 나타내는 문자열" 세 인자를 받는다.

      다음 출처에서 에러를 캡처할 수 있다.

      1. 컴포넌트 랜더
      2. 이벤트 핸들러
      3. 생명 주기 훅
      4. setup() 함수
      5. 감시자
      6. 커스텀 디렉티브 훅
      7. 트랜지션 훅

      TIP
        프로덕션에서는 3번째 인수 (info)가 전체 정보 문자열 대신 축약된 코드로 제공된다. 
        코드와 문자열 매핑은 프로덕션 오류 코드 참조(https://ko.vuejs.org/error-reference/#runtime-errors)에서 확인할 수 있다.

    예제

      app.config.errorHandler = (err, instance, info) => {
        // 에러 핸들링: 서비스 에러 로그 기록
      }

  -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

  app.config.warnHandler

    app.config.warnHandler는 Vue 애플리케이션에서 발생한 경고 메시지를 전역으로 처리하는 함수를 설정하는 속성이다.
    경고 메시지는 Vue가 개발 중에 발견한 잠재적인 문제를 알려주는 메시지로, 주로 잘못된 사용법이나 예상치 못한 동작에 대한 경고로 사용된다.

    app.config.warnHandler를 사용하면 전역적으로 발생한 경고 메시지를 캐치하고 처리할 수 있다.
    이를 통해 애플리케이션 전체에서 동일한 경고 처리 로직을 적용할 수 있다.

    이 함수는 다음과 같은 형식을 따른다.

      app.config.warnHandler = function (msg, vm, trace) {
        // msg : 발생한 경고 메시지
        // vm : Vue 인스턴스
        // trace : 경고 메시지의 스택 트레이스

        //경고 메시지 처리 로직을 여기에 작성한다.
      }
    
    이 함수는 세 개의 매개변수를 가지고 있다.

      1. msg : 발생한 경고 메시지다. 이 메시지에는 경고의 내용이 포함되어 있다.
      2. vm : 경고가 발생한 Vue 인스턴스이다. 이 인스턴스를 사용하여 애플리케이션의 상태를 확인하거나 조작할 수 있다.
      3. trace : 경고 메시지의 스택 트레이스이다. 이를 통해 경고가 발생한 위치와 관련된 정보를 얻을 수 있다.

    이 함수를 사용하여 발생한 경고를 적절히 처리하고 로깅하거나 사용자에게 피드백을 제공할 수 있다.
    예를 들어, 경고 메시지를 콘솔에 로그로 출력하거나, 사용자에게 알림을 표시하는 등의 작업을 수행할 수 있다.

    Vue에서 런타임 경고 발생 시, 트리거 될 커스텀 핸들러를 정의한다.

    타입

      interface AppConfig {
        warnHandler?: (
          msg: string,
          instance: ComponentPublicInstance | null,
          trace: string
        ) => void
      }

    세부 사항

      첫 번째 인자로 경고 메시지, 두 번째 인자로 발생한 컴포넌트 인스턴스, 세 번째 인자로 컴포넌트 추적 문자열을 받는다.

      특정 경고를 필터링하여 콘솔의 장황함을 줄일 수 있다. 모든 Vue 경고는 개발 중에 해결돼야 한다.
      따라서 이 함수는 디버깅 시에 많은 경고 중에서 특정 경고에 초점을 맞추는 것이 좋으며, 디버깅이 완료되면 제거해야 한다.

      TIP
        경고는 개발 모드에서만 발생하므로, 이것은 프로덕션 모드에서 무시된다.

      
    예제
      app.config.warnHandler = (msg, instance, trace) => {
        // `trace`는 컴포넌트 계층 구조를 추적한 문자열이다.
      }
      
  -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

  app.config.performance

    app.config.performance는 Vue 애플리케이션의 성능 관련 설정을 담고 있는 속성이다.
    이 속성은 애플리케이션의 렌더링 및 감지 성능에 영향을 미치는 여러 가지 옵션을 구성할 수 있다.

    일반적으로 app.config.performance는 개발 중에 성능 모니터링 및 디버깅을 위해 사용된다.
    이를 통해 이플리케이션의 렌더링 시간, 업ㄷ에티으 시간 등을 측정하고 프로파일링할 수 있다.
    이 설정을 사용하여 개발 중에 성능 문제를 발견하고 해결할 수 있다.

    주요 성능 관련 옵션으로는 다음과 같은 것들이 있을 수 있다.

      1. app.config.performance.measure
        성능 측정을 활성하할지 여부를 결정한다. 기본값은 false이며, 이를 true로 설정하면 성능 측정이 활성화된다.
      2. app.config.performance.maxMemory
        렌더링 성능 모니터링 시 메모리 사용량의 최대 임계값을 설정한다. 이 값을 초과하는 경우 경고가 표시된다.
      3. app.config.performance.maxRenders
        렌더링 성능 모니터링 시 한 번의 업데이트에서 최대 렌더링 횟수를 설정한다. 이 값을 초과하는 경우 경고가 표시된다.

    이러한 성능 관련 설정을 사용하여 애플리케이션의 성능을 모니터링하고 최적화할 수 있다.
    그러나 일반적으로 이러한 설정은 개발 중에만 사용되며, 프로덕션 환경에서는 비활성화하는 것이 좋다.
    성능 측정은 애플리케이션의 성능에 영향을 미치며, 프로덕션 환경에서는 이러한 측정이 필요하지 않을 을 수 있다.

    
    이것을 true로 설정하면(크롬 기준) 브라우저 개발자 도구의 성능(Performance) 탭 -> 소요시간(Timings) 패널에 컴포넌트 초기화, 컴파일, 렌더링, 패치 성능 추적 기록이 활성화 된다.
    브라우저가 performance.mark API를 지원하고 개발 모드일 경우에만 작동(기록)한다.

    타입 : boolean

    1. app.config.compilerOptions.isCustomElement
      런타임 컴파일러 옵션을 설정한다. 이 객체에 설정된 값은 브라우저 내 템플릿 컴파일러에 전달되고,
      설정된 앱의 모든 컴포넌트에 영향을 미친다. compilerOptions 옵션을 사용하여 컴포넌트별로 이러한 옵션을 재정의할 수도 있다.

      중요
        이 옵션은 전체 빌드(예: 브라우저에서 템플릿을 컴파일할 수 있는 독립 실행성 vue.js)를 사용할 때만 적용된다.
        빌드 셋업과 함께 런타임 전용 빌드를 사용하는 경우, 빌드 도구 환경설정을 통해 컴파일러 옵션을 @vue/compiler-dom으로 전달해야 한다.
        - vue-loader의 경우: compilerOptions 로더 옵션을 통해 전달. vue-cli에서 환경설정 하는 방법도 참고 필요
        - vite의 경우 : @vitejs/plugin-vue 옵션을 통해 전달

      네이티브(native) 커스텀 엘리먼트 인식하기 위한 검사 방법을 지정한다.

      타입: (tag, string) -> boolean
      
      세부사항: 태그가 네이티브 커스텀 요소로 처리되어야 하는 경우, true가 반환돼야 한다. 일치하는 태그의 경우 Vue는 Vue 컴포넡트로 확인하는 대신 기본 엘리먼트로 렌더링한다.
                네이티브 HTML과 SVG 태그는 Vue 파서가 자동으로 인식하므로, 이 함수로 검사 작업을 할 필요가 없다.

      예제
        // 'ion-'으로 시작하는 모든 태그를 커스텀 엘리먼트로 처리
        app.config.compilerOptions.isCustomElement = (tag) => {
          return tag.startsWith('ion-')
        }

    2. app.config.compilerOptions.whitespace
      템플릿 내 공백 처리 방식을 설정한다.

      타입: 'condense' | 'preserve'

      기본 값: 'condense'

      세부사항: Vue는 템플릿에서 공백 문자를 제거/축소하여, 보다 효율적으로 컴파일된 결과물을 생성한다. 다음과 같이 기본적으로 "축소"에 초점을 두어 작동한다.
        1. 엘리먼트 내부의 선행/종료 공백 문자열은 단일 공백으로 축소된다.
        2. 엘리먼트 간의 개행(중바꿈)을 표함하는 공백 문자는 제거된다.
        3. 텍스트 노드의 연속된 공백 문자열은 단일 공백으로 축소된다.

      이 옵션을 'preserve'로 설정하면 (2)와 (3)이 비활성화된다.

      예제
        app.config.compilerOptions.whitespace = 'preserve'

    3. app.config.compilerOptions.delimiters
      템플릿 내 텍스트 보간에 사용되는 구분 기호를 설정한다.

      타입: [string, string]

      기본 값: ['{{','}}']

      세부 사항: 이것은 일반적으로 이중 중괄호 문법을 사용하는 서버 측 프레임워크와의 충돌을 피하기 위해 사용된다.

      예제:
        // 구분 기호가 ES6 템플릿 문자열 스타일로 변경됨
        app.config.compilerOptions.delimiters = ['${', '}']

    4. app.compilerOptions.comments
      템플릿에서 HTML 주석 보존 여부를 설정한다.

      타입: boolean

      기본 값: false

      세부 사항: 기본적으로 Vue는 프로덕션에서 주석을 제거하지만, 개발 중에는 항상 보존한다. 강제로 프로덕션 환경에서 주석을 보존해야 하는 경우, 이 옵션을 true로 설정해야 한다.
        일반적으로 이 옵션은 Vue와 HTML 주석에 의존하는 다른 라이브러리를 함께 사용해야 할 때 사용된다.

      예제:
        app.config.compilerOptions.comments = true

  -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

    app.config.globalProperties

      app.config.globalProperties는 Vue 3 애플리케이션에서 전역으로 사용자 정의 속성을 설정하는 데 사용되는 속성이다.
      이를 통해 모든 컴포넌트에서 사용할 수 있는 사용자 정의 속성을 정의할 수 있다.

      일반적으로 이러한 전역 속성은 Vue 인스턴스에 등록된 모든 컴포넌트에서 사용할 수 있다. 
      이는 특정 컴포넌트에 대해 반복적으로 속성을 정희할 필요 없이 전역으로 정의된 속성을 모든 컴포넌트에서 사용할 수 있다는 장점을 제공한다.

      예를 들어, 언어 설정과 같은 전역적인 설정 값을 사용하려는 경우
      app.config.globalProperties를 사용하여 이를 설정할 수 있다.

        import { createApp } from 'vue';
        import App from './App.vue';

        const app = createApp(App);

        app.config.globalProperties.$lang = 'en';

        app.mount('#app');

      위의 코드에서 $lang은 전역 속성으로 설정되었다. 이제 모든 Vue 컴포넌트에서 $lang을 사용하여 전역적인 언어 설정 값을 엑세스할 수 있다.

        <template>
          <div>
            <p>{{ $lang }}</p>
          </div>
        </template>

        <script>
        export default {
          mounted() {
            console.log(this.$lang); // 'en'
          }
        };
        </script>

      위의 예제에서 $lang은 모든 컴포넌트에서 사용 가능한 전역 속성으로 등록되어 있으며, 언어 설정과 같은 전역적인 데이터를 사용할 때 유용하게 사용될 수 있다.
      그러나 전역 속성은 남용되지 않도록 주의해야 한다. 과도한 전역 속성은 애플리케이션의 복잡성을 증가시킬 수 있으며, 컴포넌트 간의 의존성을 낮추는 것이 중요하다.


      앱 내부의 컴포넌트 인스턴스에 접근할 수 있는 전역 속성을 등록하는 데 사용되는 객체이다.

      타입

        interface AppConfig {
          globalProperties: Record<string, any>
        }

      세부 사항

        이것은 Vue 3에서 지원하지 않는 Vue 2의 Vue.prototype을 대체하며, 특별한 경우에만 사용해야 한다.
        전역 속성이 컴포넌트 자체 속성과 충돌하는 경우, 컴포넌트 자체 속성이 더 높은 우선 순위를 갖는다.

      사용법

        app.config.globalProperties.msg = '안녕!'

      이렇게 하면 앱 내 모든 컴포넌트 인스턴스의 this와 컴포넌트 템플릿에서 msg를 사용할 수 있다.

      export default {
        mounted() {
          console.log(this.msg) // '안녕!'
        }
      }

  -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

  app.config.optionMergeStrategies

    app.config.optionMergeStrategies는 Vue 3 애플리케이션에서 옵션 병합 전략을 정의하는 데 사용되는 객체이다.
    이를 통해 사용자 정의 옵션을 병합하는 방법을 정의할 수 있다.

    Vue 컴포넌트의 옵션은 전체 애플리케이션에서 상속될 수 있다. 예를 들어 'data', 'methods', 'computed' 등의 옵션이 컴포넌트 내에서 정의되어 있지 않으면
    상위 컴포넌트에서 해당 옵션을 상속받게 된다. 이러한 옵션의 병합은 사용자 정의 전략을 사용하여 제어할 수 있다.

    app.config.optionMergeStrategies 객체는 다음과 같은 형식을 가진다.

      {
        optionName: function (parentValue, childValue, vm) {
          // custom merge logic
        }
      }

    이 객체의 각 프로퍼티는 병합할 옵션의 이름을 나타내며, 해당 값은 두 개의 인수를 받는 함수이다.
    첫 번째 인수는 부모 컴포넌트에서의 옵션 값이고, 
    두 번째 인수는 자식 컴포넌트에서의 옵션 값이다.
    세 번째 인수는 Vue 인스턴스이다.

    이러한 함수 내에서 사용자 정의된 병합 로직을 구현할 수 있다.
    이 로직은 주로 어떤 옵션을 어떻게 병합할지를 결정하는 데 사용된다. 
    예를 들어, 두개의 객체를 합치거나 배열을 병합하는 등의 작업을 수행할 수 있다.

    옵션 병합 전략을 사용하면 Vue 컴포넌트의 동작을 더 세밀하게 제어할 수 있으며, 특정 상황에 필요한 병합 로직을 사용할 수 있다.
    그러나 보통은 기본 병합 전략을 사용하는 것이 일반적이며, 사용자 정의 옵션 병합은 특별한 상황에 필요한 경우에만 사용된다.


    컴포넌트 옵션의 커스텀 병합 함수를 정의하기 위한 객체이다.

    타입:
    
      interface AppConfig {
        optionMergeStrategies: Record<string, OptionMergeFunction>
      }

      type OptionMergeFunction = (to: unknown, from: unknown) => any

    세부사항
    
      일부 플러그인/라이브러리는 전역 믹스인(mixin)을 삽입하여, 커스텀 컴포넌트 옵션을 추가로 지원한다.
      여러 소스(예: 믹스인 또는 컴포넌트 상속)에서 동일한 옵션을 "병합"해야 하는 경우, 이러한 옵션에는 특별한 병합 로직이 필요할 수 있다.

      app.config.optionMergeStrategies 객체에 옵션 이름을 키(key)로 하는 커스텀 병합 함수를 할당하여 등록할 수 있다.

      병합 함수는 부모 및 자식 인스턴스에 정의된 해당 옵션의 값을 각각 첫 번째 그리고 두 번째 인자로 받는다.

    예제

      const app = createApp({
        // 자체 옵션
        msg: 'Vue',
        // 믹스인으로부터 전달받는 옵션
        mixins: [
          {
            msg: '안녕 '
          }
        ],
        mounted() {
          // this.$options에 병합된 옵션이 노출됨
          console.log(this.$options.msg)
        }
      })

      // `msg`의 커스텀 병합 로직 정의
      app.config.optionMergeStrategies.msg = (parent, child) => {
        return (parent || '') + (child || '')
      }

      app.mount('#app')
      // 앱 mounted 트리거 후 로그: '안녕 Vue'


-->
<script>
export default {
	setup() {
		return {};
	},
};
</script>

<style lang="scss" scoped></style>
