<template>
	<div></div>
</template>
<!--  

  타입에서 타입 만들기

    TypeScript의 타입 시스템은 다른 타입을 기반으로 타입을 표현할 수 있기 때문에 매우 강력하다.

    이 아이디어의 가장 간단한 형태는 제네릭이다. 또한, 사용할 수 있는 다양한 타입 연산자들이 있다.
    이미 가지고 있는 값에 대한 타입을 표현할 수도 있다.

    여러 타입 연산자를 결합함으로써, 복잡한 연사과 값을 간결하고 유지보수 가능한 방식으로 표현할 수 있다.
    이 섹션에서는 기존 타입이나 값에 대한 새로운 타입을 표현하는 방법을 다룰 것이다.

    1. Generics - 매개변수를 가지는 타입들
      제네릭은 재사용 가능한 컴포넌트를 만드는 방법을 제공한다.
      제네릭 타입은 다른 타입과 연결되어 있으며, 특정 타입에 대해 작동하는 범용 타입으로 사용된다.

    2. Keyof Type Operator - keyof 연산자를 사용하여 새로운 타입 생성
      keyof 연산자는 객체 타입의 모든 키를 문자열 리터럴 유니온으로 추출한다.
      이를 통해 객체의 키에 기반한 타입을 정의할 수 있다.

    3. Typeof Type Operator - typeof 연산자를 사용하여 새로운 타입 생성
      typeof 연산자는 변수나 속성의 타입을 캡처하여 사용한다.
      이를 통해 JavaScript 값의 타입을 기반으로 TypeScript 타입을 생성할 수 있다.

    4. Indexed Access Types - Type['a'] 구문을 사용한 타입의 하위 집합 접근
      이 구문을 사용하면, 객체나 배열 내 특정 속성의 타입에 접근할 수 있다.
      이는 복잡한 객체 구조 내에서 특정 타입을 추출할 때 유용하다.

    5. Conditional Types - 타입 시스템 내에서 if 문처럼 사용하는 타입들
      조건부 타입은 입력 타입에 따라 다른 타입을 반환할 수 있다.
      이는 타입의 조건 분기를 가능하게 하여 더 동적인 타입 연산을 제공한다.

    6. Mapped Types - 기존 타입의 각 속성을 매핑하여 타입 생성
      매핑된 타입은 기존 타입의 각 키를 순회하면서 변형을 가할 수 있는 방법을 제공한다.
      이를 통해 유현하게 타입을 변형시킬 수 있다.

    7. Template Literal Types - 템플릿 리터럴 문자열을 통해 속성을 변경하는 매핑 타입
      템플릿 리터럴 타입은 문자열 템플릿을 사용하여 타입을 동적으로 생성할 수 있다.
      이 기능은 문자열 패턴에 따라 다양한 타입을 유연하게 정의할 수 있게 해준다.


-->
<script>
export default {
	setup() {
		return {};
	},
};
</script>

<style lang="scss" scoped></style>
